const _0x59dd62 = _0x447c;
(function (_0x17da22, _0x157e53) {
    const _0xff89c9 = _0x447c,
        _0x2b9c84 = _0x17da22();
    while (!![]) {
        try {
            const _0x203bd1 = parseInt(_0xff89c9(0x139)) / 0x1 + parseInt(_0xff89c9(0x153)) / 0x2 * (-parseInt(_0xff89c9(0x16c)) / 0x3) + parseInt(_0xff89c9(0x132)) / 0x4 + parseInt(_0xff89c9(0x1e1)) / 0x5 + parseInt(_0xff89c9(0x13c)) / 0x6 * (parseInt(_0xff89c9(0x1d5)) / 0x7) + -parseInt(_0xff89c9(0x177)) / 0x8 + parseInt(_0xff89c9(0x150)) / 0x9 * (-parseInt(_0xff89c9(0x15d)) / 0xa);
            if (_0x203bd1 === _0x157e53) break;
            else _0x2b9c84['push'](_0x2b9c84['shift']());
        } catch (_0x11ae53) {
            _0x2b9c84['push'](_0x2b9c84['shift']());
        }
    }
}(_0x4935, 0x3413d), require(_0x59dd62(0x17d)));

function _0x4935() {
    const _0x5133fb = ['trim', 'Sukses Tinggal Save Ya Kakak', 'now', 'Maaf Kak Fitur ', 'includes', '10kAhzua', 'floor', 'awesome-phonenumber', 'splice', 'formatpost\x0a⭔', 'split', 'tekspushkonv2', '\x0a┅═┅┅═┅┅═┅┅═┅┅═┅┅═┅\x0a\x0a乂 𝗙𝗜𝗧𝗨𝗥 𝗢𝗧𝗛𝗘𝗥\x0a⭔', 'charAt', 'catch', 'Maaf Fitur Ini Hanya Bisa Digunakan Oleh Admin Group', 'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789', 'locale', 'pushkontak id|teks\x0a\x0aSebelum Menggunakan Silahkan Salin Dulu Id Group Nya Di Atas', '\x0a\x0aitem1.X-ABLabel:Ponsel\x0a\x0aitem2.EMAIL;type=INTERNET:tesheroku123@gmail.com\x0a\x0aitem2.X-ABLabel:Email\x0a\x0aitem3.URL:https://bit.ly/39Ivus6\x0a\x0aitem3.X-ABLabel:YouTube\x0a\x0aitem4.ADR:;;Indonesia;;;;\x0a\x0aitem4.X-ABLabel:Region\x0a\x0aEND:VCARD', '54276LqQwTf', '*SUKSES MODE PUBLIC ✅*', './owner.json', 'imageMessage', 'message', 'performance-now', 'toLowerCase', 'menu', 'Group Chat', '#FFFFFF', 'exports', '1759232vOKngK', '.net', '_Wᴀɪᴛɪɴɢ ɪɴ ᴘʀᴏɢʀᴇss !!_', 'random', ' jeda|teks', 'Self Mode', './config.js', 'utf8', './functions.js', 'groupAcceptInvite', 'groupFetchAllParticipating', 'moment-timezone', 'Maaf Fitur Tersebut Hanya Bisa Digunakan Di Saat Bot Menjadi Admin Group\x0aNOTE : Jadikan Bot Sebagai Admin Jika Ingin Menggunakan Fitur ', '\x0a*☍ Mode :* ', 'buttonsResponseMessage', 'pushkontakv3 *jeda|teks*\x0a⭔', 'savecontactv1', 'qc *teks*\x0a\x0a乂 𝗙𝗜𝗧𝗨𝗥 𝗢𝗪𝗡𝗘𝗥\x0a⭔', 'Asia/Jakarta', 'jpm *teks|jeda*\x0a⭔', ' Kontak', 'matchAll', 'util', ' Hanya Bisa Di Gunakan Di Dalam Group\x0aUntuk Memasukan Bot Ke Dalam Group Yang Di Ingin Kan\x0aSilahkan Ketik Command .join linkgroup', 'File Kontak Sudh Di Kirim Lewat Private Chat', 'readFileSync', 'resolve', 'bold', 'Hallo Kak @', 'isGroup', 'Private Chat', 'owner', 'uptime', 'savecontactv1\x0a\x0a- 𝙎𝙪𝙗𝙨𝙘𝙧𝙞𝙗𝙚 𝙔𝙤𝙪𝙩𝙪𝙗𝙚\x0ayoutube.com/@VinssBotz\x0a\x0a⌕ ❙❘❙❙❘❙❚❙❘❙❙❚❙❘❙❘❙❚❙❘❙❙❚❙❘❙❙❘❙❚❙❘ ⌕\x0a          『 *© VinssStore* 』\x0a\x0a*_© VinssStore  || BY YAN_*', 'sendMessage', 'writeFileSync', ' GROUP\x0a\x0a', 'selectedButtonId', './data/database/contacts.json', 'map', 'cache', 'Succes Boss!', 'owner\x0a⭔', 'donasi', '@s.whatsapp.net', 'endsWith', 'watchFile', './data/database/contacts.vcf', 'groupMetadata', 'get', 'tagall', 'templateButtonReplyMessage', 'result', '\x0a*☍ Status :* ', 'test', 'pushkontak *idgroup|teks*\x0a⭔', 'Nih Kak Tinggal Pencet File Di Atas Terus Save', 'TEL;type=CELL;type=VOICE;waid=', 'randomBytes', 'extendedTextMessage', 'sewa', 'jimp', 'rgb', '*❏––––––『 DONASI 𝐁𝐎𝐓 』––––––❏*\x0a \x0a⫹⫺ ᴅᴏɴᴀsɪ \x0a⏣ ᴅᴀɴᴀ: [ 088293169156 ] \x0a⏣ ᴏᴠᴏ: [ 088293169156 ]\x0a⏣ ǫʀɪs ᴀʟʟ ᴘᴀʏ : [ https://telegra.ph/file/f1f5c1462399bd9aa0273.jpg ]\x0a\x0a𝚃𝚛𝚒𝚖𝚊𝚔𝚊𝚜𝚒𝚑 𝙱𝚊𝚐𝚒 𝚈𝚐 𝙱𝚎𝚛𝚍𝚘𝚗𝚊𝚜𝚒 😁\x0a\x0a⌕ ❙❘❙❙❘❙❚❙❘❙❙❚❙❘❙❘❙❚❙❘❙❙❚❙❘❙❙❘❙❚❙❘ ⌕\x0a         ❨ *VinssStore Official* ❩', 'Maaf Fitur Ini Hanya Bisa Digunakan Di Group Chat', '@adiwajshing/baileys', 'quote', 'payment\x0a⭔', 'match', 'Khusus Private Chat', 'getName', 'User Bot', 'axios', 'Kamu Siapa? Owner Ku Bukan Kalau Bukan Jangan Gunain Command Ini Ya', 'Hai Kak @', 'self\x0a⭔', 'tekspushkonv3', 'cekidgc', '*FORMAT JASA POST YANPEDIA !*  \x0a( BUKAN MILIK ADMIN )\x0a\x0a⭔ ITEM : \x0a⭔ SPEK : \x0a⭔ HARGA : \x0a⭔ NO WA : \x0a\x0a✅ TAWAR MENAWAR LANGSUNG HUBUNGI KONTAK DI ATAS !\x0a✅ WAJIB MENGGUNAKAN JASA ADMIN *YANPEDIA* SUPAYA TERHINDAR DARI PENIPUAN  !\x0a✅ BE SMART BUYYER', '*🔰PAYMENT YANPEDIA ⚡*\x0a```SEMUA PEMBAYARAN\x0aWAJIB MENYERTAKAN BUKTI TRANSFER !!```\x0a*_( ALL TRX NO REFF‼️ )_*\x0a\x0a*• GOPAY 💳 :* BEKU\x0a```( ATAS NAMA: - )```\x0a\x0a*• DANA 💳 :*```088293169156\x0a( ATAS NAMA: Adyla )```\x0a\x0a*• OVO 💳 :*```088293169156\x0a( ATAS NAMA: ASROPAH )```\x0a\x0a*• SHOPPE PAY 💳 :*```BELOM BUAT\x0a( ATAS NAMA: - )```\x0a\x0a*• QRIS 💳 :*_https://telegra.ph/file/f1f5c1462399bd9aa0273.jpg*\x0a```( ATAS NAMA: BAGAS STORE )```\x0a\x0a*© YANPEDIA ⚡*', 'jadibot', 'pushName', 'unwatchFile', 'donasi\x0a⭔', 'redBright', 'user', '@g.us', 'Otw Boskuuu', 'pushkontakv2', 'Penggunaan Salah Silahkan Gunakan Command Seperti Ini\x0a', 'https://chat.whatsapp.com/', 'syntax-error', '◎ © Hay Kak @', 'mimetype', '2065308bFmBxM', 'sewa\x0a⭔', 'BEGIN:VCARD', 'chat', ' linkgc', 'child_process', '❏ *INFO GROUP*\x0a│⭔ *NAMA :* ', 'BEGIN:VCARD\x0a\x0aVERSION:3.0\x0a\x0aN:', 'packname', 'startsWith', 'join *linkgroup*\x0a⭔', 'caption', '1029090ebnlUv', 'image', 'key', './data/user.json', 'VERSION:3.0', 'Kirim perintah ', '⬣ *LIST GROUP ANDA*\x0a\x0aTotal Group : ', 'Untuk Penggunaan Silahkan Ketik Command ', 'Update ', 'msg', 'log', ' teks|jeda\x0a\x0aReply Gambar Untuk Mengirim Gambar Ke Semua Group\x0aUntuk Jeda Itu Delay Jadi Nominal Jeda Itu 1000 = 1 detik', 'Minta Ke @', 'remoteJid', 'FN:WA[', 'tekspushkonv1', 'script\x0a⭔', 'END:VCARD', 'push', 'script', 'cekidgc\x0a⭔', 'parse', 'Owner Bot', 'contacts.vcf', 'chalk', 'filter', 'entries', 'selectedId', 'png', 'base64', 'Maaf Kak Fitur Ini Hanya Bisa Di Gunakan Di Pribadi Chat', 'length', 'author', 'stringify', 'Public Mode', 'jadibot\x0a⭔', 'text/vcard', '\x0a╰────|\x0a\x0a', 'savecontact *idgroup*\x0a⭔', 'pushkontakv3', 'pushkontakv1', 'sendImageAsSticker', '\x0a│⭔ *ID :* ', 'conversation', '\x0aSewa Bot ? Hubungi Admin Untuk Nego Wa.me/6285295374964', 'quoted', '1440548doJdTt', 'slice', 'participants', 'public', 'Link Invalid!', ' idgroup|jeda|teks\x0aUntuk Liat Id Group Silahkan Ketik .idgroup', 'tekspushkon', '304384ERlHli', 'public\x0a⭔', 'join', '6XFMJFk', 'post', 'from', 'documentMessage', '*SUCCESFUL ✅*', 'videoMessage', 'pushkontakv2 *idgroup|jeda|teks*\x0a⭔', 'text', 'admin', 'tagall *teks*\x0a⭔', 'then', 'data', 'Sukses File Sudah Di Kirim Lewat Chat Private', 'Selamat ', '\x1b[1;31m~\x1b[1;37m> [\x1b[1;32mCMD\x1b[1;37m]', 'https://bot.lyo.su/quote/generate', ' idgroup|tekspushkontak\x0aUntuk Liat Id Group Silahkan Ketik .cekidgc', 'string', '\x0a\x0aitem1.TEL;waid=', 'jpm', '4472766jwGGmz', 'subject', '\x0a‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎\x0a══✪〘 *👥 Tag All* 〙✪══\x0a', '26Dnszkt', '\x0a\x0aFN:', 'self', 'downloadAndSaveMediaMessage', 'format'];
    _0x4935 = function () {
        return _0x5133fb;
    };
    return _0x4935();
}
const {
    baileys,
    proto,
    generateWAMessage,
    generateWAMessageFromContent,
    getContentType,
    prepareWAMessageMedia
} = require(_0x59dd62(0x1b8)), {
    getGroupAdmins,
    fetchJson,
    reSize,
    generateProfilePicture,
    sleep,
    runtime,
    tanggal
} = require(_0x59dd62(0x17f)), {
    jadibot,
    conns
} = require('./jadibot'), {
    exec,
    spawn,
    execSync
} = require(_0x59dd62(0x1da)), cheerio = require('cheerio'), chalk = require(_0x59dd62(0x11c)), crypto = require('crypto'), util = require('util'), axios = require(_0x59dd62(0x1bf)), fs = require('fs'), syntaxerror = require(_0x59dd62(0x1d2)), Jimp = require(_0x59dd62(0x1b4)), path = require('path'), PhoneNumber = require(_0x59dd62(0x15f)), speed = require(_0x59dd62(0x171)), moment = require(_0x59dd62(0x182)), {
    uptotelegra
} = require('./upload'), owner = JSON[_0x59dd62(0x119)](fs['readFileSync'](_0x59dd62(0x16e))), datuser = JSON[_0x59dd62(0x119)](fs['readFileSync'](_0x59dd62(0x1e4)));

function _0x447c(_0x7bb177, _0x47447c) {
    const _0x493529 = _0x4935();
    return _0x447c = function (_0x447c58, _0x47016d) {
        _0x447c58 = _0x447c58 - 0x110;
        let _0x769775 = _0x493529[_0x447c58];
        return _0x769775;
    }, _0x447c(_0x7bb177, _0x47447c);
}
module[_0x59dd62(0x176)] = client = async (_0x4b1b8c, _0x5eb611, _0x22c5b8, _0x16e8e5) => {
    const _0x384195 = _0x59dd62;
    try {
        const _0x1fada5 = getContentType(_0x5eb611[_0x384195(0x170)]),
            _0x503784 = JSON['stringify'](_0x5eb611['message']),
            _0x34e351 = _0x5eb611['key'][_0x384195(0x111)],
            _0x48354f = _0x5eb611[_0x384195(0x131)] ? _0x5eb611[_0x384195(0x131)] : _0x5eb611,
            _0x4fdeb2 = (_0x48354f[_0x384195(0x1ea)] || _0x48354f)[_0x384195(0x1d4)] || '',
            _0x51df0c = _0x1fada5 === _0x384195(0x12f) && _0x5eb611[_0x384195(0x170)][_0x384195(0x12f)] ? _0x5eb611[_0x384195(0x170)][_0x384195(0x12f)] : _0x1fada5 == _0x384195(0x16f) && _0x5eb611[_0x384195(0x170)][_0x384195(0x16f)][_0x384195(0x1e0)] ? _0x5eb611[_0x384195(0x170)]['imageMessage'][_0x384195(0x1e0)] : _0x1fada5 == 'documentMessage' && _0x5eb611[_0x384195(0x170)][_0x384195(0x13f)]['caption'] ? _0x5eb611[_0x384195(0x170)][_0x384195(0x13f)][_0x384195(0x1e0)] : _0x1fada5 == _0x384195(0x141) && _0x5eb611[_0x384195(0x170)][_0x384195(0x141)][_0x384195(0x1e0)] ? _0x5eb611[_0x384195(0x170)][_0x384195(0x141)]['caption'] : _0x1fada5 == _0x384195(0x1b2) && _0x5eb611[_0x384195(0x170)][_0x384195(0x1b2)][_0x384195(0x143)] ? _0x5eb611['message'][_0x384195(0x1b2)]['text'] : _0x1fada5 == _0x384195(0x185) && _0x5eb611[_0x384195(0x170)]['buttonsResponseMessage'][_0x384195(0x19c)] ? _0x5eb611[_0x384195(0x170)][_0x384195(0x185)][_0x384195(0x19c)] : _0x1fada5 == 'templateButtonReplyMessage' && _0x5eb611[_0x384195(0x170)][_0x384195(0x1aa)][_0x384195(0x11f)] ? _0x5eb611[_0x384195(0x170)][_0x384195(0x1aa)][_0x384195(0x11f)] : '',
            _0x4d2d93 = typeof _0x5eb611[_0x384195(0x143)] == 'string' ? _0x5eb611[_0x384195(0x143)] : '',
            _0x32eb7e = /^[°zZ#$@*+,.?=''():√%!¢£¥€π¤ΠΦ_&><`™©®Δ^βα~¦|/\\©^]/ [_0x384195(0x1ad)](_0x51df0c) ? _0x51df0c[_0x384195(0x1bb)](/^[°zZ#$@*+,.?=''():√%¢£¥€π¤ΠΦ_&><!`™©®Δ^βα~¦|/\\©^]/gi) : '.',
            _0x451777 = _0x51df0c[_0x384195(0x1de)](_0x32eb7e),
            _0x599e5b = _0x451777 ? _0x51df0c[_0x384195(0x133)](_0x32eb7e[_0x384195(0x123)])[_0x384195(0x158)]()[_0x384195(0x162)](' ')['shift']()[_0x384195(0x172)]() : '',
            _0x2f5374 = _0x51df0c[_0x384195(0x158)]()['split'](/ +/)[_0x384195(0x133)](0x1),
            _0x8f07b4 = q = _0x2f5374[_0x384195(0x13b)](' '),
            _0x2c58e6 = _0x34e351[_0x384195(0x1a4)](_0x384195(0x1cd)),
            _0x257fb5 = _0x2c58e6 ? await _0x4b1b8c[_0x384195(0x1a7)](_0x5eb611[_0x384195(0x1d8)])[_0x384195(0x166)](_0xf638a => {}) : '',
            _0x3a0bbd = _0x2c58e6 ? _0x257fb5[_0x384195(0x196)] : '',
            _0x31a5d5 = _0x2c58e6 ? await _0x257fb5[_0x384195(0x134)] : '',
            _0x52b338 = _0x2c58e6 ? await _0x31a5d5[_0x384195(0x11d)](_0xd835b => _0xd835b[_0x384195(0x144)] !== null)['map'](_0x38b5ba => _0x38b5ba['id']) : '',
            _0xf94445 = _0x2c58e6 ? _0x257fb5['participants'] : '',
            _0x183fcb = _0x2c58e6 ? _0x52b338['includes'](_0x5eb611['sender']) : ![],
            _0x2cf01a = await _0x4b1b8c['decodeJid'](_0x4b1b8c[_0x384195(0x1cc)]['id']),
            _0x28ad6 = _0x2c58e6 ? _0x52b338['includes'](_0x2cf01a) : ![],
            _0x4d3305 = _0x2c58e6 ? _0x52b338[_0x384195(0x15c)](_0x2cf01a) : ![],
            _0x34fc1f = _0x2c58e6 ? _0x52b338[_0x384195(0x15c)](_0x5eb611['sender']) : ![],
            _0x7b4718 = _0x5eb611[_0x384195(0x1e3)]['fromMe'] ? _0x4b1b8c[_0x384195(0x1cc)]['id']['split'](':')[0x0] + _0x384195(0x1a3) || _0x4b1b8c[_0x384195(0x1cc)]['id'] : _0x5eb611['key']['participant'] || _0x5eb611['key']['remoteJid'],
            _0xfe42d3 = _0x7b4718[_0x384195(0x162)]('@')[0x0],
            _0x98a7f2 = _0x5eb611[_0x384195(0x1c8)] || '' + _0xfe42d3,
            _0x4d721d = _0x2cf01a[_0x384195(0x15c)](_0xfe42d3),
            _0x672ab7 = owner[_0x384195(0x15c)](_0xfe42d3) || _0x4d721d,
            _0x2b981f = await moment['tz'](_0x384195(0x189))[_0x384195(0x157)]('HH'),
            _0x3e6e3d = await moment['tz'](_0x384195(0x189))[_0x384195(0x157)]('mm'),
            _0x2c0298 = await moment['tz'](_0x384195(0x189))['format']('ss'),
            _0x20fec6 = moment(Date[_0x384195(0x15a)]())['tz'](_0x384195(0x189))[_0x384195(0x169)]('id')['format']('a'),
            _0xd3b188 = _0x384195(0x149) + _0x20fec6['charAt'](0x0)['toUpperCase']() + _0x20fec6[_0x384195(0x133)](0x1),
            _0x592a93 = _0x2b981f + ':' + _0x3e6e3d + ':' + _0x2c0298,
            _0x3eea0c = async (_0x1d28ff, _0x4bcd3e) => {
                const _0x52f22c = _0x384195;
                try {
                    _0x4bcd3e ? _0x4bcd3e : {};
                    const _0xf9c885 = await axios({
                        'method': _0x52f22c(0x1a8),
                        'url': _0x1d28ff,
                        'headers': {
                            'DNT': 0x1,
                            'Upgrade-Insecure-Request': 0x1
                        },
                        ..._0x4bcd3e,
                        'responseType': 'arraybuffer'
                    });
                    return _0xf9c885[_0x52f22c(0x147)];
                } catch (_0x55868c) {
                    return _0x55868c;
                }
            }, _0x4c6bea = JSON['parse'](fs[_0x384195(0x190)]('./data/database/contacts.json')), _0x575d98 = _0x4c6bea['includes'](_0x7b4718), _0x613da8 = (_0x22dacc = '') => {
                const _0x4cb50a = _0x384195;
                return [..._0x22dacc[_0x4cb50a(0x18c)](/@([0-9]{5,16}|0)/g)][_0x4cb50a(0x19e)](_0x303b1d => _0x303b1d[0x1] + _0x4cb50a(0x1a3));
            }, _0x1b6968 = _0x136ddf => {
                return _0x136ddf['match'](new RegExp(/https?:\/\/(www\.)?[-a-zA-Z0-9@:%.+~#=]{1,256}\.[a-zA-Z0-9()]{1,6}\b([-a-zA-Z0-9()@:%+.~#?&/=]*)/, 'gi'));
            }, _0x2a51dd = _0x378ce5 => {
                const _0xa94726 = _0x384195;
                return crypto[_0xa94726(0x1b1)](_0x378ce5)['toString']('hex')['slice'](0x0, _0x378ce5);
            }, _0x65b849 = (_0x178ff1, _0x2d5d1c) => {
                return !_0x2d5d1c ? chalk['green'](_0x178ff1) : chalk['keyword'](_0x2d5d1c)(_0x178ff1);
            }, _0x22d82a = _0x5cf86e => {
                const _0x158adb = _0x384195;
                let _0x3a53b7 = '';
                const _0x166f38 = _0x158adb(0x168),
                    _0x3e6c21 = _0x166f38[_0x158adb(0x123)];
                for (let _0x114cc3 = 0x0; _0x114cc3 < _0x5cf86e; _0x114cc3++) {
                    _0x3a53b7 += _0x166f38[_0x158adb(0x165)](Math[_0x158adb(0x15e)](Math[_0x158adb(0x17a)]() * _0x3e6c21));
                }
                return _0x3a53b7;
            }, _0x31950c = _0x471f3b => {
                const _0x2707f5 = _0x384195;
                _0x4b1b8c[_0x2707f5(0x199)](_0x34e351, {
                    'text': _0x471f3b
                }, {
                    'quoted': _0x5eb611
                });
            };
        _0x451777 && _0x5eb611['isGroup'] && console[_0x384195(0x1eb)](chalk['bold'][_0x384195(0x1b5)](0xff, 0xb2, 0x66)(_0x384195(0x14a)), chalk[_0x384195(0x192)]['rgb'](0x99, 0xff, 0x99)(_0x599e5b), chalk[_0x384195(0x192)][_0x384195(0x1b5)](0xcc, 0xcc, 0x0)(_0x384195(0x13e)), chalk['bold'][_0x384195(0x1b5)](0x99, 0xff, 0xcc)(_0x98a7f2), chalk['bold'][_0x384195(0x1b5)](0xcc, 0xcc, 0x0)('in'), chalk[_0x384195(0x192)][_0x384195(0x1b5)](0xff, 0xb2, 0x66)(_0x384195(0x174)), chalk[_0x384195(0x192)]('[' + _0x2f5374[_0x384195(0x123)] + ']'));
        _0x451777 && !_0x5eb611[_0x384195(0x194)] && console[_0x384195(0x1eb)](chalk[_0x384195(0x192)]['rgb'](0xff, 0xb2, 0x66)(_0x384195(0x14a)), chalk[_0x384195(0x192)][_0x384195(0x1b5)](0x99, 0xff, 0x99)(_0x599e5b), chalk[_0x384195(0x192)][_0x384195(0x1b5)](0xcc, 0xcc, 0x0)(_0x384195(0x13e)), chalk['bold'][_0x384195(0x1b5)](0x99, 0xff, 0xcc)(_0x98a7f2), chalk[_0x384195(0x192)][_0x384195(0x1b5)](0xcc, 0xcc, 0x0)('in'), chalk[_0x384195(0x192)][_0x384195(0x1b5)](0xff, 0xb2, 0x66)(_0x384195(0x195)), chalk['bold']('[' + _0x2f5374['length'] + ']'));
        try {
            ppuser = await _0x4b1b8c['profilePictureUrl'](_0x7b4718, _0x384195(0x1e2));
        } catch (_0x29ab92) {
            ppuser = 'https://cdn.pixabay.com/photo/2015/10/05/22/37/blank-profile-picture-973460_960_720.png?q=60';
        }
        let _0x2591d8 = [];
        for (let _0x3791c5 of owner) {
            _0x2591d8[_0x384195(0x116)]({
                'displayName': await _0x4b1b8c[_0x384195(0x1bd)](_0x3791c5 + '@s.whatsapp.net'),
                'vcard': _0x384195(0x1dc) + await _0x4b1b8c[_0x384195(0x1bd)](_0x3791c5 + _0x384195(0x1a3)) + _0x384195(0x154) + await _0x4b1b8c[_0x384195(0x1bd)](_0x3791c5 + '@s.whatsapp.net') + _0x384195(0x14e) + _0x3791c5 + ':' + _0x3791c5 + _0x384195(0x16b)
            });
        }

        function _0x286738() {
            const _0x43c446 = _0x384195;
            let _0x2a06c3 = _0x43c446(0x1c0);
            _0x31950c(_0x2a06c3);
        }

        function _0x5afb51() {
            const _0x32ed0c = _0x384195;
            _0x31950c(_0x32ed0c(0x1b7));
        }
        const _0x288a93 = await _0x3eea0c(ppuser);
        switch (_0x599e5b) {
        case _0x384195(0x173): {
            owned = nomerOwner + _0x384195(0x1a3), ngen = _0x384195(0x193) + _0x7b4718[_0x384195(0x162)]('@')[0x0] + '\x0a*BOT WHATSAPP BY VINSS STORE ✨*\x0a\x0a      *⏤͟͟͞͞★ INFO - BOT ꗄ➺* \x0a\x0a*☍ Nama BOTz :* VINSS-MD\x0a*☍ Version BOTz :* v8.0.0\x0a*☍ Nomor Creator :* @' + owned['split']('@')[0x0] + _0x384195(0x184) + (_0x4b1b8c['public'] ? _0x384195(0x126) : _0x384195(0x17c)) + _0x384195(0x1ac) + (_0x672ab7 ? _0x384195(0x11a) : _0x384195(0x1be)) + '\x0a*☍ Runtime:* ' + runtime(process[_0x384195(0x197)]()) + _0x384195(0x164) + _0x32eb7e + _0x384195(0x1ba) + _0x32eb7e + _0x384195(0x1ca) + _0x32eb7e + _0x384195(0x1d6) + _0x32eb7e + _0x384195(0x161) + _0x32eb7e + _0x384195(0x1a1) + _0x32eb7e + _0x384195(0x114) + _0x32eb7e + _0x384195(0x188) + _0x32eb7e + _0x384195(0x13a) + _0x32eb7e + _0x384195(0x1c2) + _0x32eb7e + _0x384195(0x118) + _0x32eb7e + _0x384195(0x127) + _0x32eb7e + _0x384195(0x145) + _0x32eb7e + _0x384195(0x1df) + _0x32eb7e + 'post *teks*\x0a⭔' + _0x32eb7e + _0x384195(0x18a) + _0x32eb7e + _0x384195(0x1ae) + _0x32eb7e + 'pushkontakv1 *teks*\x0a⭔' + _0x32eb7e + _0x384195(0x142) + _0x32eb7e + _0x384195(0x186) + _0x32eb7e + _0x384195(0x12a) + _0x32eb7e + _0x384195(0x198), _0x4b1b8c['sendMessage'](_0x34e351, {
                'image': thumb,
                'caption': ngen,
                'mentions': [_0x7b4718, owned]
            }, {
                'quoted': _0x5eb611
            });
        }
        break;
        case 'formatpost': {
            teks938 = _0x384195(0x1c5), _0x31950c(teks938);
        }
        break;
        case 'payment': {
            teks137 = _0x384195(0x1c6), _0x31950c(teks137);
        }
        break;
        case _0x384195(0x1a2): {
            teks28 = _0x384195(0x1b6), _0x4b1b8c[_0x384195(0x199)](_0x34e351, {
                'image': {
                    'url': 'https://telegra.ph/file/f1f5c1462399bd9aa0273.jpg'
                },
                'caption': teks28
            }, {
                'quoted': _0x5eb611
            });
        }
        break;
        case _0x384195(0x1b3): {
            teks91 = _0x384195(0x1d3) + _0x7b4718[_0x384195(0x162)]('@')[0x0] + _0x384195(0x130), _0x4b1b8c['sendMessage'](_0x34e351, {
                'text': teks91,
                'mentions': [_0x7b4718]
            }, {
                'quoted': _0x5eb611
            });
        }
        break;
        case _0x384195(0x135): {
            if (!_0x672ab7) return _0x286738();
            _0x4b1b8c[_0x384195(0x135)] = !![], _0x31950c(_0x384195(0x16d));
        }
        break;
        case _0x384195(0x155): {
            if (!_0x672ab7) return _0x286738();
            _0x4b1b8c['public'] = ![], _0x31950c('*SUKSES MODE SELF ✅*');
        }
        break;
        case _0x384195(0x117):
        case 'sc': {
            notag = nomerOwner + _0x384195(0x1a3), _0x4b1b8c[_0x384195(0x199)](_0x34e351, {
                'text': _0x384195(0x110) + notag[_0x384195(0x162)]('@')[0x0],
                'mentions': [notag]
            }, {
                'quoted': _0x5eb611
            });
        }
        break;
        case _0x384195(0x1c7): {
            if (!_0x672ab7) return _0x286738();
            if (_0x5eb611['isGroup']) return _0x31950c(_0x384195(0x122));
            await jadibot(_0x4b1b8c, _0x5eb611, _0x34e351);
        }
        break;
        case _0x384195(0x196): {
            const _0x57939b = await _0x4b1b8c[_0x384195(0x199)](_0x34e351, {
                'contacts': {
                    'displayName': _0x2591d8[_0x384195(0x123)] + _0x384195(0x18b),
                    'contacts': _0x2591d8
                }
            }, {
                'quoted': _0x5eb611
            });
            _0x4b1b8c[_0x384195(0x199)](_0x34e351, {
                'text': _0x384195(0x1c1) + _0x7b4718[_0x384195(0x162)]('@')[0x0] + ', Itu Owner Ku Dia Lagi Need Kontak Cewek Save Ya Buat Cewek, Bytheway Jangan Galak-galak Ya.',
                'mentions': [_0x7b4718]
            }, {
                'quoted': _0x57939b
            });
        }
        break;
        case _0x384195(0x1c4): {
            if (!_0x672ab7) return _0x286738();
            let _0x379cba = await _0x4b1b8c[_0x384195(0x181)](),
                _0x1c8ed7 = Object[_0x384195(0x11e)](_0x379cba)['slice'](0x0)[_0x384195(0x19e)](_0x467ce8 => _0x467ce8[0x1]),
                _0xcce9ff = _0x1c8ed7[_0x384195(0x19e)](_0x570d7f => _0x570d7f['id']),
                _0x3ccdf2 = _0x384195(0x1e7) + _0xcce9ff['length'] + _0x384195(0x19b);
            for (let _0x378663 of _0xcce9ff) {
                let _0x2a40cc = await _0x4b1b8c[_0x384195(0x1a7)](_0x378663);
                _0x3ccdf2 += _0x384195(0x1db) + _0x2a40cc[_0x384195(0x151)] + _0x384195(0x12e) + _0x2a40cc['id'] + '\x0a│⭔ *MEMBER :* ' + _0x2a40cc[_0x384195(0x134)][_0x384195(0x123)] + _0x384195(0x129);
            }
            _0x31950c(_0x3ccdf2 + (_0x384195(0x1e8) + _0x32eb7e + _0x384195(0x16a)));
        }
        break;
        case _0x384195(0x14f):
        case 'post': {
            if (!_0x672ab7) return _0x286738();
            if (!_0x8f07b4) return _0x31950c('*Penggunaan Salah Silahkan Gunakan Seperti Ini*\x0a' + (_0x32eb7e + _0x599e5b) + _0x384195(0x1ec));
            await _0x31950c('_Wᴀɪᴛɪɴɢ ɪɴ ᴘʀᴏɢʀᴇss !!_');
            let _0x1a996d = await _0x4b1b8c[_0x384195(0x181)](),
                _0x5bfa0a = Object[_0x384195(0x11e)](_0x1a996d)[_0x384195(0x133)](0x0)[_0x384195(0x19e)](_0x3b07c8 => _0x3b07c8[0x1]),
                _0x3f69f9 = _0x5bfa0a['map'](_0x2299eb => _0x2299eb['id']);
            for (let _0x20a885 of _0x3f69f9) {
                let _0x22b8ed = await _0x4b1b8c['groupMetadata'](_0x20a885),
                    _0x19213c = await _0x22b8ed[_0x384195(0x134)];
                /image/ [_0x384195(0x1ad)](_0x4fdeb2) ? (media = await _0x4b1b8c[_0x384195(0x156)](_0x48354f), mem = await uptotelegra(media), await _0x4b1b8c[_0x384195(0x199)](_0x20a885, {
                    'image': {
                        'url': mem
                    },
                    'caption': _0x8f07b4[_0x384195(0x162)]('|')[0x0],
                    'mentions': _0x19213c[_0x384195(0x19e)](_0x2a017f => _0x2a017f['id'])
                }), await sleep(_0x8f07b4[_0x384195(0x162)]('|')[0x1])) : (await _0x4b1b8c[_0x384195(0x199)](_0x20a885, {
                    'text': _0x8f07b4[_0x384195(0x162)]('|')[0x0],
                    'mentions': _0x19213c[_0x384195(0x19e)](_0x1bd771 => _0x1bd771['id'])
                }), await sleep(_0x8f07b4[_0x384195(0x162)]('|')[0x1]));
            }
            _0x31950c(_0x384195(0x140));
        }
        break;
        case 'pushkontak': {
            if (!_0x672ab7) return _0x286738();
            if (_0x2c58e6) return _0x31950c(_0x384195(0x1bc));
            if (!_0x8f07b4) return _0x31950c('Penggunaan Salah Silahkan Gunakan Command Seperti Ini\x0a' + (_0x32eb7e + _0x599e5b) + _0x384195(0x14c));
            await _0x31950c(_0x384195(0x179));
            const _0x344729 = !_0x2c58e6 ? await _0x4b1b8c[_0x384195(0x1a7)]('' + _0x8f07b4[_0x384195(0x162)]('|')[0x0])[_0x384195(0x166)](_0x15a576 => {}) : '',
                _0xd36b04 = !_0x2c58e6 ? await _0x344729[_0x384195(0x134)] : '',
                _0x5e14da = await _0xd36b04[_0x384195(0x11d)](_0x96206 => _0x96206['id'][_0x384195(0x1a4)](_0x384195(0x178)))[_0x384195(0x19e)](_0x2f4414 => _0x2f4414['id']);
            global[_0x384195(0x138)] = _0x8f07b4['split']('|')[0x1];
            for (let _0x1fd6d2 of _0x5e14da) {
                if (_0x575d98) return;
                _0x4c6bea[_0x384195(0x116)](_0x1fd6d2), fs['writeFileSync']('./data/database/contacts.json', JSON['stringify'](_0x4c6bea)), /image/ [_0x384195(0x1ad)](_0x4fdeb2) ? (media = await _0x4b1b8c[_0x384195(0x156)](_0x48354f), memk = await uptotelegra(media), await _0x4b1b8c[_0x384195(0x199)](_0x1fd6d2, {
                    'image': {
                        'url': memk
                    },
                    'caption': global[_0x384195(0x138)]
                }), await sleep(0xbb8)) : (await _0x4b1b8c[_0x384195(0x199)](_0x1fd6d2, {
                    'text': global['tekspushkon']
                }), await sleep(0xbb8));
            }
            try {
                const _0x7cbcc8 = [...new Set(_0x4c6bea)],
                    _0x274356 = _0x7cbcc8[_0x384195(0x19e)]((_0x31d79f, _0x121bca) => {
                        const _0xfb3121 = _0x384195,
                            _0x22e993 = [_0xfb3121(0x1d7), 'VERSION:3.0', _0xfb3121(0x112) + _0x2a51dd(0x2) + '] ' + _0x31d79f[_0xfb3121(0x162)]('@')[0x0], 'TEL;type=CELL;type=VOICE;waid=' + _0x31d79f[_0xfb3121(0x162)]('@')[0x0] + ':+' + _0x31d79f[_0xfb3121(0x162)]('@')[0x0], _0xfb3121(0x115), '']['join']('\x0a');
                        return _0x22e993;
                    })['join']('');
                fs['writeFileSync'](_0x384195(0x1a6), _0x274356, _0x384195(0x17e));
            } catch (_0x2bda7e) {
                _0x31950c(util['format'](_0x2bda7e));
            } finally {
                await _0x4b1b8c[_0x384195(0x199)](_0x34e351, {
                    'document': fs[_0x384195(0x190)]('./data/database/contacts.vcf'),
                    'fileName': _0x384195(0x11b),
                    'caption': _0x384195(0x1af),
                    'mimetype': _0x384195(0x128)
                }, {
                    'quoted': m
                }), _0x4c6bea[_0x384195(0x160)](0x0, _0x4c6bea[_0x384195(0x123)]), fs[_0x384195(0x19a)](_0x384195(0x19d), JSON[_0x384195(0x125)](_0x4c6bea));
            }
        }
        break;
        case _0x384195(0x12c): {
            if (!_0x672ab7) return _0x286738();
            if (!_0x5eb611[_0x384195(0x194)]) return _0x31950c(_0x384195(0x15b) + (_0x32eb7e + _0x599e5b) + _0x384195(0x18e));
            if (!_0x8f07b4) return _0x31950c(_0x384195(0x1d0) + (_0x32eb7e + _0x599e5b) + ' teks');
            await _0x31950c('_Wᴀɪᴛɪɴɢ ɪɴ ᴘʀᴏɢʀᴇss !!_');
            const _0x5e4f07 = _0x2c58e6 ? await _0x4b1b8c['groupMetadata'](_0x34e351)['catch'](_0x2d1500 => {}) : '',
                _0x2cb966 = _0x2c58e6 ? _0x5e4f07['owner'] : '',
                _0x2f755d = _0x2c58e6 ? await _0x5e4f07[_0x384195(0x134)] : '',
                _0x3c9a2e = await _0x2f755d[_0x384195(0x11d)](_0x3e69bc => _0x3e69bc['id'][_0x384195(0x1a4)](_0x384195(0x178)))[_0x384195(0x19e)](_0x1e4de6 => _0x1e4de6['id']);
            global[_0x384195(0x113)] = _0x8f07b4;
            for (let _0x3bff0b of _0x3c9a2e) {
                if (_0x575d98) return;
                _0x4c6bea[_0x384195(0x116)](_0x3bff0b), fs[_0x384195(0x19a)](_0x384195(0x19d), JSON[_0x384195(0x125)](_0x4c6bea)), /image/ [_0x384195(0x1ad)](_0x4fdeb2) ? (media = await _0x4b1b8c[_0x384195(0x156)](_0x48354f), mem = await uptotelegra(media), await _0x4b1b8c['sendMessage'](_0x3bff0b, {
                    'image': {
                        'url': mem
                    },
                    'caption': global['tekspushkonv1']
                }), await sleep(0xbb8)) : (await _0x4b1b8c[_0x384195(0x199)](_0x3bff0b, {
                    'text': global[_0x384195(0x113)]
                }), await sleep(0xbb8));
            }
            _0x31950c(_0x384195(0x18f));
            try {
                const _0x232f7b = [...new Set(_0x4c6bea)],
                    _0x2893d9 = _0x232f7b[_0x384195(0x19e)]((_0x5264cc, _0x4a1299) => {
                        const _0x46424b = _0x384195,
                            _0x22caeb = [_0x46424b(0x1d7), _0x46424b(0x1e5), _0x46424b(0x112) + _0x2a51dd(0x2) + '] ' + _0x5264cc[_0x46424b(0x162)]('@')[0x0], _0x46424b(0x1b0) + _0x5264cc[_0x46424b(0x162)]('@')[0x0] + ':+' + _0x5264cc[_0x46424b(0x162)]('@')[0x0], _0x46424b(0x115), ''][_0x46424b(0x13b)]('\x0a');
                        return _0x22caeb;
                    })[_0x384195(0x13b)]('');
                fs['writeFileSync']('./data/database/contacts.vcf', _0x2893d9, _0x384195(0x17e));
            } catch (_0x274dd2) {
                _0x31950c(util[_0x384195(0x157)](_0x274dd2));
            } finally {
                await _0x4b1b8c[_0x384195(0x199)](_0x7b4718, {
                    'document': fs['readFileSync'](_0x384195(0x1a6)),
                    'fileName': _0x384195(0x11b),
                    'caption': _0x384195(0x1af),
                    'mimetype': _0x384195(0x128)
                }, {
                    'quoted': m
                }), _0x4c6bea['splice'](0x0, _0x4c6bea[_0x384195(0x123)]), fs[_0x384195(0x19a)](_0x384195(0x19d), JSON['stringify'](_0x4c6bea));
            }
        }
        break;
        case _0x384195(0x1cf):
            if (!_0x672ab7) return _0x286738();
            if (!q) return _0x31950c('Penggunaan Salah Silahkan Gunakan Command Seperti Ini\x0a' + (_0x32eb7e + _0x599e5b) + _0x384195(0x137));
            await _0x31950c(_0x384195(0x1ce));
            const _0x551b05 = !_0x2c58e6 ? await _0x4b1b8c[_0x384195(0x1a7)]('' + q[_0x384195(0x162)]('|')[0x0])[_0x384195(0x166)](_0x474fce => {}) : '',
                _0xad721d = !_0x2c58e6 ? await _0x551b05[_0x384195(0x134)] : '',
                _0x4f2004 = await _0xad721d[_0x384195(0x11d)](_0x17395e => _0x17395e['id'][_0x384195(0x1a4)](_0x384195(0x178)))[_0x384195(0x19e)](_0x48bae3 => _0x48bae3['id']);
            global[_0x384195(0x163)] = q['split']('|')[0x2];
            for (let _0x3041d3 of _0x4f2004) {
                /image/ [_0x384195(0x1ad)](_0x4fdeb2) ? (media = await _0x4b1b8c['downloadAndSaveMediaMessage'](_0x48354f), memk = await uptotelegra(media), await _0x4b1b8c['sendMessage'](_0x3041d3, {
                    'image': {
                        'url': memk
                    },
                    'caption': global[_0x384195(0x163)]
                }), await sleep(q['split']('|')[0x1])) : (await _0x4b1b8c[_0x384195(0x199)](_0x3041d3, {
                    'text': global[_0x384195(0x163)]
                }), await sleep(q['split']('|')[0x1]));
            }
            _0x31950c(_0x384195(0x1a0));
            break;
        case _0x384195(0x12b):
            if (!_0x672ab7) return _0x286738();
            if (!_0x5eb611[_0x384195(0x194)]) return _0x31950c(_0x384195(0x15b) + (_0x32eb7e + _0x599e5b) + _0x384195(0x18e));
            if (!_0x8f07b4) return _0x31950c(_0x384195(0x1d0) + (_0x32eb7e + _0x599e5b) + _0x384195(0x17b));
            await _0x31950c(_0x384195(0x1ce));
            const _0x4361f4 = await _0x31a5d5[_0x384195(0x11d)](_0xc68a95 => _0xc68a95['id'][_0x384195(0x1a4)](_0x384195(0x178)))[_0x384195(0x19e)](_0xc8fbd8 => _0xc8fbd8['id']);
            global['tekspushkonv3'] = _0x8f07b4['split']('|')[0x1];
            for (let _0x4ba490 of _0x4361f4) {
                /image/ ['test'](_0x4fdeb2) ? (media = await _0x4b1b8c[_0x384195(0x156)](_0x48354f), mem = await uptotelegra(media), await _0x4b1b8c[_0x384195(0x199)](_0x4ba490, {
                    'image': {
                        'url': mem
                    },
                    'caption': global[_0x384195(0x1c3)]
                }), await sleep(_0x8f07b4[_0x384195(0x162)]('|')[0x0])) : (await _0x4b1b8c[_0x384195(0x199)](_0x4ba490, {
                    'text': global[_0x384195(0x1c3)]
                }), await sleep(_0x8f07b4[_0x384195(0x162)]('|')[0x0]));
            }
            _0x31950c('Succes Boss!');
            break;
        case _0x384195(0x187): {
            if (!_0x672ab7) return _0x286738();
            if (!_0x5eb611[_0x384195(0x194)]) return _0x31950c('Maaf Kak Fitur ' + (_0x32eb7e + _0x599e5b) + _0x384195(0x18e));
            await _0x31950c(_0x384195(0x179));
            const _0x387369 = _0x2c58e6 ? await _0x4b1b8c[_0x384195(0x1a7)](_0x34e351)[_0x384195(0x166)](_0x52e22e => {}) : '',
                _0x25e304 = _0x2c58e6 ? _0x387369['owner'] : '',
                _0x2ddaed = _0x2c58e6 ? await _0x387369[_0x384195(0x134)] : '',
                _0x280ccb = await _0x2ddaed['filter'](_0x1bc7aa => _0x1bc7aa['id'][_0x384195(0x1a4)]('.net'))[_0x384195(0x19e)](_0x40daac => _0x40daac['id']);
            for (let _0x3bd6a1 of _0x280ccb) {
                if (_0x575d98) return;
                _0x4c6bea[_0x384195(0x116)](_0x3bd6a1), fs[_0x384195(0x19a)](_0x384195(0x19d), JSON[_0x384195(0x125)](_0x4c6bea));
            }
            _0x31950c(_0x384195(0x148));
            try {
                const _0x10297d = [...new Set(_0x4c6bea)],
                    _0x51655e = _0x10297d['map']((_0x32ad6e, _0x3f11a6) => {
                        const _0x274536 = _0x384195,
                            _0x137d02 = [_0x274536(0x1d7), _0x274536(0x1e5), _0x274536(0x112) + _0x2a51dd(0x2) + '] ' + _0x32ad6e['split']('@')[0x0], _0x274536(0x1b0) + _0x32ad6e[_0x274536(0x162)]('@')[0x0] + ':+' + _0x32ad6e[_0x274536(0x162)]('@')[0x0], _0x274536(0x115), ''][_0x274536(0x13b)]('\x0a');
                        return _0x137d02;
                    })[_0x384195(0x13b)]('');
                fs[_0x384195(0x19a)](_0x384195(0x1a6), _0x51655e, 'utf8');
            } catch (_0x36102b) {
                _0x31950c(util[_0x384195(0x157)](_0x36102b));
            } finally {
                await _0x4b1b8c[_0x384195(0x199)](_0x7b4718, {
                    'document': fs['readFileSync'](_0x384195(0x1a6)),
                    'fileName': 'contacts.vcf',
                    'caption': _0x384195(0x159),
                    'mimetype': 'text/vcard'
                }, {
                    'quoted': m
                }), _0x4c6bea[_0x384195(0x160)](0x0, _0x4c6bea[_0x384195(0x123)]), fs['writeFileSync']('./data/database/contacts.json', JSON['stringify'](_0x4c6bea));
            }
        }
        break;
        case 'savecontact': {
            if (!_0x672ab7) return _0x286738();
            if (_0x2c58e6) return _0x31950c(_0x384195(0x1bc));
            if (!_0x8f07b4) return _0x31950c(_0x384195(0x1d0) + (_0x32eb7e + _0x599e5b) + ' idgroup\x0aUntuk Liat Id Group Silahkan Ketik .cekidgc');
            await _0x31950c(_0x384195(0x179));
            const _0x24a493 = !_0x2c58e6 ? await _0x4b1b8c[_0x384195(0x1a7)]('' + _0x8f07b4)[_0x384195(0x166)](_0x37ee40 => {}) : '',
                _0x48c691 = !_0x2c58e6 ? await _0x24a493[_0x384195(0x134)] : '',
                _0x1c02cf = await _0x48c691[_0x384195(0x11d)](_0xc0bc73 => _0xc0bc73['id'][_0x384195(0x1a4)](_0x384195(0x178)))[_0x384195(0x19e)](_0x2add0d => _0x2add0d['id']);
            for (let _0x20bb9c of _0x1c02cf) {
                if (_0x575d98) return;
                _0x4c6bea['push'](_0x20bb9c), fs['writeFileSync'](_0x384195(0x19d), JSON[_0x384195(0x125)](_0x4c6bea));
            }
            try {
                const _0x3a7778 = [...new Set(_0x4c6bea)],
                    _0xd91dea = _0x3a7778['map']((_0x18a2f1, _0x2aee7e) => {
                        const _0x1b34d2 = _0x384195,
                            _0x469a73 = [_0x1b34d2(0x1d7), _0x1b34d2(0x1e5), 'FN:WA[' + _0x2a51dd(0x2) + '] ' + _0x18a2f1[_0x1b34d2(0x162)]('@')[0x0], _0x1b34d2(0x1b0) + _0x18a2f1[_0x1b34d2(0x162)]('@')[0x0] + ':+' + _0x18a2f1[_0x1b34d2(0x162)]('@')[0x0], 'END:VCARD', ''][_0x1b34d2(0x13b)]('\x0a');
                        return _0x469a73;
                    })['join']('');
                fs['writeFileSync'](_0x384195(0x1a6), _0xd91dea, _0x384195(0x17e));
            } catch (_0x4e0937) {
                _0x31950c(util[_0x384195(0x157)](_0x4e0937));
            } finally {
                await _0x4b1b8c[_0x384195(0x199)](_0x34e351, {
                    'document': fs[_0x384195(0x190)](_0x384195(0x1a6)),
                    'fileName': _0x384195(0x11b),
                    'caption': _0x384195(0x159),
                    'mimetype': 'text/vcard'
                }, {
                    'quoted': m
                }), _0x4c6bea[_0x384195(0x160)](0x0, _0x4c6bea[_0x384195(0x123)]), fs[_0x384195(0x19a)](_0x384195(0x19d), JSON[_0x384195(0x125)](_0x4c6bea));
            }
        }
        break;
        case _0x384195(0x1a9): {
            if (!_0x5eb611[_0x384195(0x194)]) return _0x31950c(_0x384195(0x15b) + (_0x32eb7e + _0x599e5b) + ' Hanya Bisa Di Gunakan Di Dalam Group\x0aUntuk Memasukan Bot Ke Dalam Group Yang Di Ingin Kan\x0aSilahkan Ketik Command .join linkgroup');
            if (!_0x34fc1f && !_0x672ab7) return _0x31950c(_0x384195(0x167));
            if (!_0x4d3305) return _0x31950c(_0x384195(0x183) + (_0x32eb7e + _0x599e5b));
            if (!q) return _0x31950c('Teks?');
            let _0x75b6a3 = (q ? q : '') + _0x384195(0x152);
            for (let _0x474908 of _0x31a5d5) {
                _0x75b6a3 += '➲ @' + _0x474908['id'][_0x384195(0x162)]('@')[0x0] + '\x0a';
            }
            _0x4b1b8c[_0x384195(0x199)](_0x34e351, {
                'text': _0x75b6a3,
                'mentions': _0x31a5d5[_0x384195(0x19e)](_0x37633f => _0x37633f['id'])
            }, {
                'quoted': _0x5eb611
            });
        }
        break;
        case _0x384195(0x13b): {
            if (!_0x672ab7) return _0x286738();
            if (!_0x8f07b4) return _0x31950c('Contoh ' + (_0x32eb7e + _0x599e5b) + _0x384195(0x1d9));
            if (!_0x1b6968(_0x2f5374[0x0]) && !_0x2f5374[0x0]['includes']('whatsapp.com')) return _0x31950c(_0x384195(0x136));
            let _0x364df8 = _0x2f5374[0x0][_0x384195(0x162)](_0x384195(0x1d1))[0x1];
            await _0x4b1b8c[_0x384195(0x180)](_0x364df8)[_0x384195(0x146)](_0x211793 => _0x31950c(util[_0x384195(0x157)](_0x211793)))[_0x384195(0x166)](_0x2b87af => _0x31950c(util[_0x384195(0x157)](_0x2b87af)));
        }
        break;
        case 'qc': {
            if (!_0x48354f) {
                const _0x535b43 = await _0x4b1b8c[_0x384195(0x1bd)](mentionUser[0x0]),
                    _0x13011e = {
                        'type': 'quote',
                        'format': _0x384195(0x120),
                        'backgroundColor': _0x384195(0x175),
                        'width': 0x200,
                        'height': 0x300,
                        'scale': 0x2,
                        'messages': [{
                            'entities': [],
                            'avatar': !![],
                            'from': {
                                'id': 0x1,
                                'name': _0x535b43,
                                'photo': {
                                    'url': ppuser
                                }
                            },
                            'text': quotedMsg['chats'],
                            'replyMessage': {}
                        }]
                    },
                    _0x5c373d = axios['post'](_0x384195(0x14b), _0x13011e, {
                        'headers': {
                            'Content-Type': 'application/json'
                        }
                    })['then'](_0x3ab498 => {
                        const _0x1b8cca = _0x384195,
                            _0x3370b1 = Buffer[_0x1b8cca(0x13e)](_0x3ab498[_0x1b8cca(0x147)][_0x1b8cca(0x1ab)][_0x1b8cca(0x1e2)], _0x1b8cca(0x121)),
                            _0x444581 = {
                                'packname': global[_0x1b8cca(0x1dd)],
                                'author': global['author']
                            };
                        _0x4b1b8c['sendImageAsSticker'](_0x34e351, _0x3370b1, m, _0x444581);
                    });
            } else {
                if (q) {
                    const _0x302c99 = {
                            'type': _0x384195(0x1b9),
                            'format': _0x384195(0x120),
                            'backgroundColor': '#FFFFFF',
                            'width': 0x200,
                            'height': 0x300,
                            'scale': 0x2,
                            'messages': [{
                                'entities': [],
                                'avatar': !![],
                                'from': {
                                    'id': 0x1,
                                    'name': _0x98a7f2,
                                    'photo': {
                                        'url': ppuser
                                    }
                                },
                                'text': q,
                                'replyMessage': {}
                            }]
                        },
                        _0xe34b14 = axios[_0x384195(0x13d)]('https://bot.lyo.su/quote/generate', _0x302c99, {
                            'headers': {
                                'Content-Type': 'application/json'
                            }
                        })[_0x384195(0x146)](_0x15d0c4 => {
                            const _0x496b68 = _0x384195,
                                _0x412426 = Buffer['from'](_0x15d0c4[_0x496b68(0x147)][_0x496b68(0x1ab)]['image'], _0x496b68(0x121)),
                                _0x56b299 = {
                                    'packname': global['packname'],
                                    'author': global[_0x496b68(0x124)]
                                };
                            _0x4b1b8c[_0x496b68(0x12d)](_0x34e351, _0x412426, m, _0x56b299);
                        });
                } else _0x31950c(_0x384195(0x1e6) + _0x599e5b + ' text atau reply pesan dengan perintah ' + _0x599e5b);
            }
        }
        break;
        default:
        }
        if (_0x4d2d93['startsWith']('>')) {
            if (!_0x672ab7) return _0x286738();
            try {
                let _0x493614 = await eval(_0x4d2d93[_0x384195(0x133)](0x2));
                if (typeof _0x493614 !== _0x384195(0x14d)) _0x493614 = require(_0x384195(0x18d))['inspect'](_0x493614);
                await _0x31950c(_0x493614);
            } catch (_0x3209d7) {
                _0x31950c(String(_0x3209d7));
            }
        }
    } catch (_0x2619a3) {
        console[_0x384195(0x1eb)](util[_0x384195(0x157)](_0x2619a3));
        let _0x307871 = String(_0x2619a3);
        _0x4b1b8c[_0x384195(0x199)](nomerOwner + '@s.whatsapp.net', {
            'text': _0x307871
        });
    }
};
let file = require[_0x59dd62(0x191)](__filename);
fs[_0x59dd62(0x1a5)](file, () => {
    const _0x22fed1 = _0x59dd62;
    fs[_0x22fed1(0x1c9)](file), console['log'](chalk[_0x22fed1(0x1cb)](_0x22fed1(0x1e9) + __filename)), delete require[_0x22fed1(0x19f)][file], require(file);
});
